def area(a, b):
    '''
    Вычисляет площадь прямоугольника.
      
      Параметры:
          a (float): длина первой стороны
          b (float): длина второй стороны
          
      Возвращает:
          float: площадь прямоугольника
    '''
    return a * b


def perimeter(a, b):
    '''
    Вычисляет периметр прямоугольника.
      
      Параметры:
          a (float): длина первой стороны
          b (float): длина второй стороны
          
      Возвращает:
          float: периметр прямоугольника
    '''
    return (a + b) * 2